

const RefundPolicy = () => {
  return (
    <div className="mx-48 sm:mx-auto my-2 p-4 w-11/12 sm:w-[1240px]">
      <h1 className="text-3xl font-bold px-2 py-8 text-center">นโยบายการคืนเงิน</h1>
      
      <div className="prose max-w-none text-gray-800">
        <p className="mb-4">
          <strong>บริษัท กรุงเทพเคมี จำกัด</strong> ขอแจ้งนโยบายการคืนเงินเพื่อเป็นข้อตกลงและสร้างความเข้าใจเกี่ยวกับการใช้บริการเว็บไซต์ ดังนี้:
        </p>
        <ul className="list-decimal ml-8 mb-8">
          <li className="mb-8">
            บริษัทฯ จะทำการคืนเงินค่าสินค้าให้กับลูกค้าในกรณีที่บริษัทฯ ไม่สามารถจัดส่งสินค้าตามที่ลูกค้าสั่งซื้อได้
          </li>
          <li className="mb-8">
            ระยะเวลาการคืนเงินค่าสินค้า มีรายละเอียดดังนี้:
            <ul className="list-decimal ml-8">
              <li>
                กรณีลูกค้าชำระเงินเต็มจำนวนหรือผ่อนชำระ ตัดผ่านบัตรเครดิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทย บริษัทจะส่งเรื่องขอคืนเงินไปยังธนาคาร โดยการคืนเงินจะขึ้นอยู่กับนโยบายของแต่ละธนาคาร ตามปกติแล้วผู้ถือบัตรจะได้รับเงินคืนในรอบบิลถัดไป
              </li>
              <li>
                กรณีลูกค้าชำระเงินเต็มจำนวน ตัดผ่านบัตรเดบิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทย บริษัทจะส่งเรื่องขอคืนเงินไปยังธนาคาร โดยการคืนเงินจะขึ้นอยู่กับนโยบายของแต่ละธนาคาร ซึ่งจะใช้ระยะเวลาในการคืนเงินตั้งแต่ 30-60 วัน นับจากวันที่ลูกค้าได้รับการแจ้งจาก Call Center
              </li>
              <li>
                กรณีลูกค้าชำระเงินเต็มจำนวน ผ่านช่องทางเคาน์เตอร์เซอร์วิส จะทำการคืนเงินกลับไปยังเลขที่บัญชีที่ลูกค้าแจ้ง โดยใช้ระยะเวลาประมาณ 7-14 วันทำการ นับจากวันที่ลูกค้าได้รับการแจ้งจาก Call Center (และมีการแจ้งเอกสารประกอบการคืนเงินครบถ้วน)
              </li>
            </ul>
          </li>
        <li className="mb-8">
          ไม่สามารถดำเนินการยกเลิก เปลี่ยนแปลง แก้ไข รายการสั่งซื้อสินค้า ในกรณีต่างๆ ดังนี้:
        
        <ul className="list-decimal ml-8 mb-8">
          <li>
            กรณีที่เกิดขึ้นจากความผิดพลาดในการสั่งซื้อสินค้า ผิดประเภทฯ ผิดรหัสรุ่น
          </li>
          <li>
            กรณีที่เกิดขึ้นจากการเปลี่ยนแปลงของราคาสินค้าที่อาจเกิดขึ้นได้ในอนาคต
          </li>
        </ul>
    </li>
        <li className="mb-8">
          บริษัทฯ จะไม่ดำเนินการจัดส่งสินค้า และต้องทำการคืนเงินเท่านั้น เนื่องจากกรณีต่างๆ ดังนี้:
        
        <ul className="list-decimal ml-8 mb-8">
          <li>
            กรณีที่เกิดขึ้นจากสินค้าหมด (เช่น สินค้าหมด Stock)
          </li>
          <li>
            กรณีที่เกิดขึ้นจากราคาสินค้าที่ระบุทางหน้า Website ไม่ตรงกับราคาที่จำหน่ายจริง
          </li>
          <li>
            กรณีที่เกิดขึ้นจากเหตุสุดวิสัย (System Error) ที่อาจเกิดขึ้น
          </li>
        </ul>
        </li>
        <li className="mb-8">
          บริษัทฯ ขอสงวนสิทธิ์ในการคืนเงินเกินระยะเวลาที่กำหนด หากเกิดเหตุสุดวิสัย
        </li>
        
        <li className="mb-8">
          บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขใดๆ โดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า
        </li>
        </ul>
        

        <p className="mb-4">
          *ขั้นตอนในการขอคืนเงินสามารถทำได้ผ่านช่องทางต่างๆดังต่อไปนี้*
        </p>
        <ul className="list-decimal ml-8 mb-4">
          <li>การติดต่อผ่าน Call center  โทร : <a href='+66930383875'>+66930383875</a> หรือ <a href='+66972486027'>+66972486027</a></li>
          <li>การส่ง Email มายัง Sale@krungthepchemi.com</li>
          <li>ช่องทาง Online ต่างๆ โดยดูรายละเอียดช่องทางการติดต่อเพิ่มเติมผ่านหน้า Contact</li>
        </ul>

        <p className="mb-4">
          *ทางบริษัทอาจจะมีการร้องขอเอกสารหรือหลักฐานประกอบการคืนเงินตามสมควรแล้วแต่กรณีที่ต้องการร้องขอเพื่อคืนเงิน และการพิจารณาจากบริษัทถือว่าเป็นที่สิ้นสุดในทุกกรณี*
        </p>
      </div>
    </div>
  );
};

export default RefundPolicy;
